---
kind: type
id: T:Autodesk.Revit.DB.PointOnEdgeFaceIntersection
source: html/3ade0249-e172-0bc2-32d6-9076f6b079cb.htm
---
# Autodesk.Revit.DB.PointOnEdgeFaceIntersection

Define a ReferencePoint at the intersection of a referenceable
edge or curve and a referenceable face.

## Syntax (C#)
```csharp
public class PointOnEdgeFaceIntersection : PointElementReference
```

## Remarks
The ReferencePoint's orientation is partially constrained
either to the edge (in the manner of PointOnEdge) or to the face
(in the manner of PointOnFace).